app/views/saidas/_form.html.erb

    <%= form.label :fornecedor_id, :class => 'control-label' %>
    <%= form.collection_select :fornecedor_id, Fornecedor.order(:nome) , :id, :nome, {:prompt => 'Selecionar'}, :class => 'form-control', :id => 'saida_fornecedor_id' %>
---
SELECT `fornecedors`.* FROM `fornecedors` ORDER BY `fornecedors`.`nome` ASC

    <%= form.label :modalidade_id, :class => 'control-label' %>
    <%= form.collection_select :modalidade_id, Modalidade.order(:nome) , :id, :nome, {:prompt => 'Selecionar'}, :class => 'form-control', :id => 'saida_modalidade_id' %>
---
SELECT `modalidades`.* FROM `modalidades` ORDER BY `modalidades`.`nome` ASC