app/views/treinos/_form.html.erb

SELECT `clientes`.* FROM `clientes` ORDER BY `clientes`.`nome` ASC
---
    <%= form.label :cliente_id, :class => 'control-label' %>
    <%= form.collection_select(:cliente_id, Cliente.order(:nome), :id, :nome, {:prompt=> 'Selecionar'}, :class=> "form-control", :id=> "idcliente") %>

SELECT `planos`.* FROM `planos` ORDER BY `planos`.`nome` ASC
---
    <%= form.label :plano_id, :class => 'control-label' %>
    <%= form.collection_select(:plano_id, Plano.order(:nome), :id, :nome, {:prompt=> 'Selecionar'}, :class=> "form-control", :id=> "idplano") %>

SELECT `exercicios`.* FROM `exercicios`
SELECT `exrciciotreinos`.* FROM `exrciciotreinos` WHERE `exrciciotreinos`.`treino_id` = 1
---
    <label>Exercício</label>
    <%= select_tag  :exercicio_id,options_from_collection_for_select(Exercicio.all, 'id','nome'), include_blank: "Selecionar", :class => 'form-control', :id => 'exercicio_id' %>

    <%= hidden_field_tag "exerciciotamanho", @treino.exrciciotreinos.length  %>