app/views/entradas/_form.html.erb

    <%= form.label :cliente_id, :class => 'control-label' %>
    <%= form.collection_select :cliente_id, Cliente.order(:nome) , :id, :nome, {:prompt => 'Selecionar'}, :class => 'form-control', :id => 'entrada_cliente_id' %>
---
SELECT `clientes`.* FROM `clientes` ORDER BY `clientes`.`nome` ASC

    <%= form.label :plano_id, :class => 'control-label' %>
    <%= form.collection_select :plano_id, Plano.order(:nome) , :id, :nome, {:prompt => 'Selecionar'}, :class => 'form-control', :id => 'entrada_plano_id' %>
---
SELECT `planos`.* FROM `planos` ORDER BY `planos`.`nome` ASC

    <%= form.label :modalidade, :class => 'control-label' %>
    <%= form.collection_select :modalidade_id, Modalidade.order(:nome) , :id, :nome, {:prompt => 'Selecionar'}, :class => 'form-control', :id => 'entrada_modalidade_id' %>
---
SELECT `modalidades`.* FROM `modalidades` ORDER BY `modalidades`.`nome` ASC