app/controllers/caixa_controller.rb

SELECT entradas.total as saldo,(SELECT sum(total) FROM entradas) FROM `entradas`
SELECT saidas.valor as saldo,(SELECT sum(valor) FROM saidas) FROM `saidas`
---
	def index
	    @saldo_e = Entrada.select("entradas.total as saldo,(SELECT sum(total) FROM entradas)")
	    @saldo_s = Saida.select("saidas.valor as saldo,(SELECT sum(valor) FROM saidas)")