app/controllers/clientes_controller.rb

  def index

    if params[:nome] == nil
       @clientes = Cliente.all
---
SELECT `clientes`.* FROM `clientes`

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nome`, `email`, `cpf`, `telefone`, `created_at`, `updated_at`) VALUES ('Paulo', 'paulo@gmail.com', '07075565389', '86998137178', '2018-09-14 12:01:25', '2018-09-14 12:01:25')

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1