app/controllers/entradas_controller.rb

SELECT `entradas`.* FROM `entradas`
---
  def index
    @entradas = Entrada.all

SELECT planos.valor as valor FROM `planos` WHERE (planos.id=1)
---
    def buscarvalorplano

    @valor = Plano.select("planos.valor as valor").where("planos.id="+params[:idplano])

INSERT INTO `entradas` (`cliente_id`, `plano_id`, `modalidade_id`, `descricao`, `valor`, `desconto`, `total`, `created_at`, `updated_at`) VALUES (1, 1, 1, 'mensalidade', 70.0, 5.0, 65.0, '2018-09-28 18:21:15', '2018-09-28 18:21:15')
---
  def create
    @entrada = Entrada.new(entrada_params)

    respond_to do |format|
      if @entrada.save

SELECT  `entradas`.* FROM `entradas` WHERE `entradas`.`id` = 0 LIMIT 1
---
    def set_entrada
      @entrada = Entrada.find(params[:id])