app/controllers/exercicios_controller.rb

  def index
    @exercicios = Exercicio.all
---
SELECT `exercicios`.* FROM `exercicios`

  def create
    @exercicio = Exercicio.new(exercicio_params)

    respond_to do |format|
      if @exercicio.save
---
INSERT INTO `exercicios` (`nome`, `serie`, `rept`, `carga`, `created_at`, `updated_at`) VALUES ('supino reto', 3, '15', '10kg', '2018-10-05 12:43:00', '2018-10-05 12:43:00')

  def update
    respond_to do |format|
      if @exercicio.update(exercicio_params)
---
UPDATE `exercicios` SET `serie` = 2, `rept` = '2', `carga` = '2', `updated_at` = '2018-10-18 01:11:59' WHERE `exercicios`.`id` = 2

    def set_exercicio
      @exercicio = Exercicio.find(params[:id])
---
SELECT  `exercicios`.* FROM `exercicios` WHERE `exercicios`.`id` = 1 LIMIT 1