app/controllers/fornecedors_controller.rb

SELECT `fornecedors`.* FROM `fornecedors` WHERE (fornecedors.nome LIKE  '%come%')
---
  def index
    @fornecedors = Fornecedor.all

INSERT INTO `fornecedors` (`nome`, `email`, `cpf`, `telefone`, `created_at`, `updated_at`) VALUES ('comercial bom', 'cb@gmail.com', '09929020129', '+5586998137178', '2018-09-14 12:01:40', '2018-09-14 12:01:40')
---
  def create
    @fornecedor = Fornecedor.new(fornecedor_params)

    respond_to do |format|
      if @fornecedor.save

SELECT  `fornecedors`.* FROM `fornecedors` WHERE `fornecedors`.`id` = 1 LIMIT 1
---
    def set_fornecedor
      @fornecedor = Fornecedor.find(params[:id])