app/controllers/modalidades_controller.rb

  def index
    @modalidades = Modalidade.all
---
SELECT `modalidades`.* FROM `modalidades`

  def create
    @modalidade = Modalidade.new(modalidade_params)

    respond_to do |format|
      if @modalidade.save
---
INSERT INTO `modalidades` (`nome`, `descricao`, `receita`, `despesa`, `created_at`, `updated_at`) VALUES ('Matricula', 'mensalmente', TRUE, FALSE, '2018-09-14 12:10:25', '2018-09-14 12:10:25')

    def set_modalidade
      @modalidade = Modalidade.find(params[:id])
---
SELECT  `modalidades`.* FROM `modalidades` WHERE `modalidades`.`id` = 1 LIMIT 1