app/controllers/planos_controller.rb

SELECT `planos`.* FROM `planos`
---
  def index
    @planos = Plano.all

INSERT INTO `planos` (`nome`, `referente`, `descricao`, `valor`, `created_at`, `updated_at`) VALUES ('Master', 'segunda a sabado', 'mensal', '70', '2018-09-14 12:01:54', '2018-09-14 12:01:54')
---
  def create
    @plano = Plano.new(plano_params)

    respond_to do |format|
      if @plano.save

SELECT  `planos`.* FROM `planos` WHERE `planos`.`id` = 1 LIMIT 1
---
    def set_plano
      @plano = Plano.find(params[:id])