app/controllers/saidas_controller.rb

  def index
    @saidas = Saida.all
---
SELECT `saidas`.* FROM `saidas`

  def create
    @saida = Saida.new(saida_params)

    respond_to do |format|
      if @saida.save
---
INSERT INTO `saidas` (`fornecedor_id`, `modalidade_id`, `descricao`, `valor`, `created_at`, `updated_at`) VALUES (1, 2, 'material limpeza', '50', '2018-09-15 01:31:00', '2018-09-15 01:31:00')

    def set_saida
      @saida = Saida.find(params[:id])
---
SELECT  `saidas`.* FROM `saidas` WHERE `saidas`.`id` = 1 LIMIT 1