app/controllers/treinos_controller.rb

SELECT `treinos`.* FROM `treinos`
---
  def index
    @treinos = Treino.all

SELECT exercicios.id, exercicios.nome, exercicios.serie, exercicios.rept, exercicios.carga FROM `exercicios` WHERE (exercicios.id=1)
---
  def exercicio
    @exercicio = Exercicio.select("exercicios.id, exercicios.nome, exercicios.serie, exercicios.rept, exercicios.carga").where("exercicios.id="+params[:idexe])

INSERT INTO `treinos` (`cliente_id`, `plano_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-10-18 01:14:22', '2018-10-18 01:14:22')
---
  def create
    @treino = Treino.new(treino_params)

    respond_to do |format|
      if @treino.save

SELECT  `treinos`.* FROM `treinos` WHERE `treinos`.`id` = 1 LIMIT 1
---
    def set_treino
      @treino = Treino.find(params[:id])