app/controllers/users_controller.rb

INSERT INTO `users` (`nome`, `tipo`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES ('Paulo Otilio', 'Admin', '2018-09-17 19:02:40', '2018-09-17 19:02:40', 'paulootilio@gmail.com', '$2a$11$w03Oxy4UxXYKIgMAsUEIm.jDfdmrzyU7N8Nw.pubqUgo4b0uiHNda')
---
  def createuser
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save